Tekla Open API Reference for Tekla Structures 2025
AnalysisDeltaZ Class
 The AnalysisDeltaZ class contains delta Z information for an analysis model.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisDeltaZ
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class AnalysisDeltaZ
Public Class AnalysisDeltaZ
The AnalysisDeltaZ type exposes the following members.
Constructors
Name | Description
AnalysisDeltaZ
 Creates a new instance of an analysis delta Z.
Top
Properties
Name | Description
Bottom
 The delta Z at the bottom.
Top
 The delta Z at the top.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace